<a href="https://colab.research.google.com/github/jaymine/pythonII/blob/master/sec_pandas/pandas_execises_set1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


Let's download the necessary datasets.

අවශ්‍ය දත්ත කට්ටල බාගත කරමු.

In [ ]:
import pandas as pd

dataset_dir = "https://raw.githubusercontent.com/GPrathap/pythonII/master/dataset/"
olympic_datset_repo = dataset_dir + "olympic_games/olympic_hosts.csv"
cryptocurrencies_dataset_repo = dataset_dir + "cryptocurrencies/Aave.csv"

olympic_dataset = pd.read_csv(olympic_datset_repo)  
olympic_dataset.to_csv('/content/sample_data/olympic_hosts.csv') 

cryptocurrencies_dataset = pd.read_csv(cryptocurrencies_dataset_repo)
cryptocurrencies_dataset.to_csv('/content/sample_data/cryptocurrencies.csv')

# **Section 01:** Creating, Reading and Writing නිර්මාණය කිරීම, කියවීම සහ ලිවීම

###**Question 01**: Observe the  Olympic dataset and create a DataFrame looks like this:

ඔලිම්පික් දත්ත සමුදාය නිරීක්ෂණය කර මේ ආකාරයට දත්ත රාමුවක් සාදන්න:

In [ ]:
olympic_dataset.head()[:2]

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016

[2 rows x 7 columns]

### **Answer:**

In [ ]:
pd.DataFrame({"game_slug":['pyeongchang-2018','rio-2016'], "game_end_date":['2018-02-25T08:00:00Z', '2016-08-21T21:00:00Z'], 
              "game_start_date":['2018-02-08T23:00:00Z', '2016-08-05T12:00:00Z'], "game_location":['Republic of Korea', 'Brazil'],
              "game_name":['PyeongChang 2018', 'Rio 2016'],"game_season":['Winter', 'Summer'], "game_year": [2018, 2016]})

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016

[2 rows x 7 columns]

### **Question 02**: Create a variable, i.e., games, with a Series including the following information

පහත දැක්වෙන තොරතුරු ඇතුළත්  **Series**, විචල්‍යයක්, එනම් ක්‍රීඩා, සාදන්න.

> name: pyeongchang-2018 ,   year: 2018

> name: rio-2016, year: 2016

### **Answer**:

In [ ]:
pd.Series([2018, 2016], index=['pyeongchang-2018','rio-2016'], name="games")

pyeongchang-2018    2018
rio-2016            2016
Name: games, dtype: int64

:### **Question 03**: How can you construct the DataFrame that you created in Question 01 using a Series object?

Seriesයක් උපයෝගී කරගනිමින් 01 වන ප්‍රශ්නයේදී ඔබ නිර්‍මාණය කළ දත්ත රාමුව ඔබ ගොඩනඟන්නේ කෙසේද?

### **Answer:**

In [ ]:
game_slug = ['pyeongchang-2018','rio-2016']
game_end_date = ['2018-02-25T08:00:00Z', '2016-08-21T21:00:00Z']
game_start_date = ['2018-02-08T23:00:00Z', '2016-08-05T12:00:00Z']
game_location =['Republic of Korea', 'Brazil']
game_name = ['PyeongChang 2018', 'Rio 2016']
game_season = ['Winter', 'Summer']
game_year = [2018, 2016]

games = pd.DataFrame({"game_slug": game_slug, "game_end_date":game_end_date, "game_start_date":game_start_date, "game_location":game_location,
                   "game_name":game_name, "game_season":game_season, "game_year":[2018, 2016]})
games

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016

[2 rows x 7 columns]

### **Question 04**: Save the DataFrame you created in question 03 as game_info.csv and read back to a DataFrame. If you observe any changes, explain why you get such behaviour? 

03 වන ප්‍රශ්නයේදී ඔබ නිර්‍මාණය කළ DataFrame එක game_info.csv ලෙස සුරකින්න, DataFrame එකකට නැවත කියවන්න. ඔබ යම් වෙනසක් නිරීක්ෂණය කරන්නේ නම්, ඔබට එවැනි හැසිරීමක් ලැබීමට හේතුව පැහැදිලි කරන්න?

### **Answer:**

In [ ]:
games.to_csv("/content/sample_data/game_info.csv")

pd.read_csv("/content/sample_data/game_info.csv")

   Unnamed: 0         game_slug  ... game_season game_year
0           0  pyeongchang-2018  ...      Winter      2018
1           1          rio-2016  ...      Summer      2016

[2 rows x 8 columns]

In [ ]:
pd.read_csv("/content/sample_data/game_info.csv", index_col=0)

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016

[2 rows x 7 columns]

# **Section 02**: Accessing, Indexing, Selecting, and Assigning ප්‍රවේශ වීම, සුචිගත කිරීම, තෝරා ගැනීම සහ පැවරීම

In [ ]:
cryptocurrencies_dataset.head()

   SNo        Date  Price  Open  High   Low       Vol.  Change %
0    1  2018-01-30   0.15  0.17  0.17  0.14   530470.0     -7.95
1    2  2018-01-31   0.14  0.15  0.15  0.13   396050.0    -11.10
2    3  2018-02-01   0.11  0.14  0.14  0.11   987260.0    -17.46
3    4  2018-02-02   0.10  0.11  0.11  0.08  1810000.0     -8.32
4    5  2018-02-03   0.11  0.10  0.12  0.09  1200000.0      6.85

### **Question 01**: Select the `Price` column from `cryptocurrencies_dataset` and assign the result to the variable `price`. Estimate the mean price using both Numpy mean function and appropriate Pandas function? 

`cryptocurrencies_dataset` වෙතින් `Price` තීරුව තෝරා ප්‍රතිඵලය විචල්‍යය වන `Price` වෙත පවරන්න.  මධ්‍යම මිල තක්සේරු කරන්න ( Numpy.mean  සහ සුදුසු පැන්ඩා ශ්‍රිතය යන දෙකම භාවිතා කර).

### **Answer:**

In [ ]:
price = cryptocurrencies_dataset.Price

#Using numpy
import numpy as np 
np.mean(price)

#Using pandas Dataframe object 
price.mean()

67.04590588235298

### **Question 02**:  Replace all values of the `High` column with 0.34.

`High` තීරයේ සියලුම අගයන් 0.34 සමඟ ප්‍රතිස්ථාපනය කරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset.High

0         0.17
1         0.15
2         0.14
3         0.11
4         0.12
         ...
1270    420.72
1271    415.39
1272    408.44
1273    415.14
1274    413.91
Name: High, Length: 1275, dtype: float64

In [ ]:
cryptocurrencies_dataset.High = 0.45

cryptocurrencies_dataset.High

0       0.45
1       0.45
2       0.45
3       0.45
4       0.45
        ...
1270    0.45
1271    0.45
1272    0.45
1273    0.45
1274    0.45
Name: High, Length: 1275, dtype: float64

### **Question 03**: Select the first value of `Price` and assign it to 0.41.

`Price` හි පළමු අගය තෝරා එය 0.41 ට පවරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset.Price.iloc[0] = 0.41 
cryptocurrencies_dataset.Price[0] = 0.78
cryptocurrencies_dataset.Price[0]

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

0.78

### **Question 04**: Select 4th row of the data from `cryptocurrencies_dataset` and assign it to the 2nd row of `cryptocurrencies_dataset`.

`cryptocurrencies_dataset` හි දත්ත වල 4 වන පේළිය තෝරා එය`cryptocurrencies_dataset` හි 2 වන පේලියට පවරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset.iloc[1]

SNo                  2
Date        2018-01-31
Price             0.14
Open              0.15
High              0.45
Low               0.13
Vol.            396050
Change %         -11.1
Name: 1, dtype: object

In [ ]:
cryptocurrencies_dataset.iloc[3]

SNo                  4
Date        2018-02-02
Price              0.1
Open              0.11
High              0.45
Low               0.08
Vol.          1.81e+06
Change %         -8.32
Name: 3, dtype: object

In [ ]:
cryptocurrencies_dataset.iloc[1] = cryptocurrencies_dataset.iloc[3]

cryptocurrencies_dataset.iloc[1]

SNo                  4
Date        2018-02-02
Price              0.1
Open              0.11
High              0.45
Low               0.08
Vol.          1.81e+06
Change %         -8.32
Name: 1, dtype: object

### **Question 05**:  Select the first five values from the `Price` column, estimate the max value, and assign it to the first five values of `Price`.

`Price` තීරුවෙන් පළමු අගයන් පහ තෝරන්න. උපරිම අගය තක්සේරු කර එය `Price` හි පළමු අගයන් පහට පවරන්න.

### **Answer:**

Ways to select තෝරා ගැනීමට ක්රම

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5]

0    0.78
1    0.10
2    0.11
3    0.10
4    0.11
Name: Price, dtype: float64

In [ ]:
cryptocurrencies_dataset.Price.head(5)

0    0.78
1    0.10
2    0.11
3    0.10
4    0.11
Name: Price, dtype: float64

In [ ]:
cryptocurrencies_dataset.loc[:4, "Price"]

0    0.78
1    0.10
2    0.11
3    0.10
4    0.11
Name: Price, dtype: float64

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5].max() #Finding the max value

0.78

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5] = cryptocurrencies_dataset.Price.iloc[:5].max()

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5]

0    0.78
1    0.78
2    0.78
3    0.78
4    0.78
Name: Price, dtype: float64

### **Question 06**: Select rows with index lables 1,45, 300, 700, and 450.

දර්ශක (index) ලේබල් 1,45, 300, 700 සහ 450 සහිත පේළි තෝරන්න.

### **Answer:**

In [ ]:
indices  = [1,45, 300, 450, 700]
cryptocurrencies_dataset.loc[indices]

     SNo        Date  Price  Open  High   Low       Vol.  Change %
1      4  2018-02-02   0.78  0.11  0.45  0.08  1810000.0     -8.32
45    46  2018-03-16   0.05  0.05  0.45  0.05   388430.0      0.00
300  301  2018-11-26   0.01  0.01  0.45  0.01   933250.0      0.00
450  451  2019-04-25   0.01  0.01  0.45  0.01   605670.0      0.00
700  701  2019-12-31   0.02  0.01  0.45  0.01  3370000.0     64.14

### **Question 07**: Create a DataFrame containing `Low`, `Vol.`, and `Price` columns that correspond to 1,45, 300, 450, 700 index labels.

දර්ශක ලේබල් 1,45, 300, 450, 700 ට අනුරූප වන `Low`,` Vol.` සහ `Price` තීරු අඩංගු දත්ත රාමුවක් සාදන්න.

### **Answer:**

In [ ]:
indices  = [1,45, 300, 450, 700]
labels = ["Low", "Vol.", "Price"]
cryptocurrencies_dataset.loc[indices, labels]

      Low       Vol.  Price
1    0.08  1810000.0   0.78
45   0.05   388430.0   0.05
300  0.01   933250.0   0.01
450  0.01   605670.0   0.01
700  0.01  3370000.0   0.02

In [ ]:
indices  = [1,45, 300, 450, 700]
labels = ["Low", "Vol.", "Price"]
cryptocurrencies_dataset.loc[indices, labels]

      Low       Vol.  Price
1    0.08  1810000.0   0.78
45   0.05   388430.0   0.05
300  0.01   933250.0   0.01
450  0.01   605670.0   0.01
700  0.01  3370000.0   0.02

### **Question 07**: Create a DataFrame containing `Low`, `Vol.`, and `Price` columns that correspond to the first 100 rows.

පළමු පේළි 100 ට අනුරූප වන `Low`,` Vol.` සහ `Price` තීරු අඩංගු දත්ත රාමුවක් සාදන්න.

### **Answer:**

In [ ]:
labels = ["Low", "Vol.", "Price"]
cryptocurrencies_dataset.loc[:100, labels]

      Low       Vol.  Price
0    0.14   530470.0   0.78
1    0.08  1810000.0   0.78
2    0.11   987260.0   0.78
3    0.08  1810000.0   0.78
4    0.09  1200000.0   0.78
..    ...        ...    ...
96   0.08  2130000.0   0.09
97   0.08  1500000.0   0.08
98   0.08   613560.0   0.08
99   0.07  1070000.0   0.07
100  0.07  2820000.0   0.07

[101 rows x 3 columns]

In [ ]:
labels_index = [5, 6, 1]
cryptocurrencies_dataset.iloc[:100, labels_index]

     Low       Vol.        Date
0   0.14   530470.0  2018-01-30
1   0.08  1810000.0  2018-02-02
2   0.11   987260.0  2018-02-01
3   0.08  1810000.0  2018-02-02
4   0.09  1200000.0  2018-02-03
..   ...        ...         ...
95  0.09  1760000.0  2018-05-05
96  0.08  2130000.0  2018-05-06
97  0.08  1500000.0  2018-05-07
98  0.08   613560.0  2018-05-08
99  0.07  1070000.0  2018-05-09

[100 rows x 3 columns]

### **Question 08**: Select all the rows where the `Price` is higher or equal to 600.

`Price` 600 ට වැඩි හෝ සමාන වන සියලුම පේළි තෝරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset[cryptocurrencies_dataset.Price >= 600]

       SNo        Date   Price    Open  High     Low     Vol.  Change %
1176  1177  2021-05-18  629.38  572.86  0.45  564.85  52890.0      9.87

### **Question 09**: Create a DataFrame containing all the `Price` and `Vol.` columns where `Change %` is higher than 0.4 and `Price` is less than 0.1   

`Change %` 0.4 ටත් ඉහළින් සහ `Price` 0.1 ටත් වඩා අඩු වන `Price` වෙළුම් තීරු සියල්ල අඩංගු දත්ත රාමුවක් සාදන්න.

### **Answer:**

# **Section 03**: Building Summary Functions and Maps ගොඩනැගිලි සාරාංශ කාර්යයන් සහ සිතියම්

In [ ]:
cryptocurrencies_dataset.head()

   SNo        Date  Price  Open  High   Low       Vol.  Change %
0    1  2018-01-30   0.78  0.17  0.45  0.14   530470.0     -7.95
1    4  2018-02-02   0.78  0.11  0.45  0.08  1810000.0     -8.32
2    3  2018-02-01   0.78  0.14  0.45  0.11   987260.0    -17.46
3    4  2018-02-02   0.78  0.11  0.45  0.08  1810000.0     -8.32
4    5  2018-02-03   0.78  0.10  0.45  0.09  1200000.0      6.85

### **Question 01**: What are the mean, median, max, and min values of the `Price` column?

`Price` තීරයේ මධ්‍යන්‍ය, මධ්‍යම, උපරිම සහ අවම අගය කුමක්ද?

### **Answer:**

In [ ]:
price = cryptocurrencies_dataset.Price
price.mean(), price.median(), price.max(), price.max()

(67.04848627450984, 0.03, 629.38, 629.38)

### **Question 02**:  How many different types of `Vol.` do exist in this dataset?

මෙම දත්ත සමූහය තුළ විවිධ මාදිලියේ කොපමණ සංඛ්‍යාවක් තිබේද?

### **Answer:**

In [ ]:
len(cryptocurrencies_dataset["Vol."].unique())

1151

### **Question 03**: What is the value of `Vol.` that repeats at most?

උපරිම වශයෙන් පුනරාවර්තනය වන `Vol.` හි වටිනාකම කුමක්ද?

### **Answer:**

In [ ]:
cryptocurrencies_dataset["Vol."].value_counts()

1070000.0    7
1210000.0    6
0.0          5
1200000.0    4
1420000.0    4
            ..
746800.0     1
205180.0     1
2800000.0    1
916780.0     1
32640.0      1
Name: Vol., Length: 1151, dtype: int64

### **Question 04**: Update the `Price` value by substracting its mean value?  

එහි සාමාන්‍ය අගය උපස්ථ කිරීමෙන් `මිල` අගය යාවත්කාලීන කරන්න?

### **Answer:**

In [ ]:
mean_price = cryptocurrencies_dataset.Price.mean()

In [ ]:
cryptocurrencies_dataset.Price = cryptocurrencies_dataset.Price - mean_price

### **Question 05**: Let's think you want to calculate the ratio of `High` to `Low` and get the information to the highest ratio. How can you calculate it?

ඔබට `High` to `Low` අනුපාතය ගණනය කර ඉහළම අනුපාතයට තොරතුරු ලබා ගැනීමට අවශ්‍ය යැයි සිතමු. ඔබට එය ගණනය කළ හැක්කේ කෙසේද?

### **Answer:**

In [ ]:
(cryptocurrencies_dataset.High/cryptocurrencies_dataset.Low).idxmax()

101

In [ ]:
cryptocurrencies_dataset.loc[(cryptocurrencies_dataset.High/cryptocurrencies_dataset.Low).idxmax()]

SNo                102
Date        2018-05-11
Price         -66.9885
Open              0.07
High              0.45
Low                  0
Vol.          2.75e+06
Change %        -13.41
Name: 101, dtype: object

In [ ]:
cryptocurrencies_dataset.loc[:4, "Price"]

0   -66.268486
1   -66.268486
2   -66.268486
3   -66.268486
4   -66.268486
Name: Price, dtype: float64

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5].max() #Finding the max value

-66.26848627450984

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5] = cryptocurrencies_dataset.Price.iloc[:5].max()

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5]

0   -66.268486
1   -66.268486
2   -66.268486
3   -66.268486
4   -66.268486
Name: Price, dtype: float64

### **Question 06**: The following description is defined how to select the best currency. Use `apply` function  to find information about the best currency.

හොඳම මුදල් ඒකකය තෝරා ගන්නේ කෙසේද යන්න පහත විස්තරයේ දක්වා ඇත. හොඳම මුදල් ඒකකය පිළිබඳ තොරතුරු සෙවීම සඳහා `apply` function භාවිතා කරන්න.

> If `Vol.` higher than 388430, get 5 rewards if not -5 rewards.

> If the `Price` higher than 500, get 10 rewards if not -15 rewards. 

> If the `Low` higher than 0.3, get 4.6 rewards if not -1.5 rewards.

### **Answer:**

In [ ]:
def rewards(row):
    if row["Vol."] > 388430 and row["Price"] > 100 and row["Low"] > 0.3:
        return 5 + 10 + 4.6
    elif row["Vol."] < 388430 and row["Price"] < 100 and row["Low"] < 0.3:
        return -5+-15+-1.5
    else:
        #TODO add other conditons as well 
        return 1

cryptocurrencies_dataset.loc[cryptocurrencies_dataset.apply(rewards, axis='columns').idxmax()]

SNo               1225
Date        2021-07-05
Price          241.582
Open            277.09
High              0.45
Low              262.3
Vol.            629440
Change %         11.38
Name: 1224, dtype: object

# **Section 04**: Grouping කණ්ඩායම් කිරීම

In [ ]:
olympic_dataset.head()

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016
2        sochi-2014  2014-02-23T16:00:00Z  ...      Winter      2014
3       london-2012  2012-08-12T19:00:00Z  ...      Summer      2012
4    vancouver-2010  2010-02-28T04:00:00Z  ...      Winter      2010

[5 rows x 7 columns]

### **Question 01**: Where did the Olympics hold most often?

ඔලිම්පික් බොහෝ විට පැවැත්වූයේ කොහේද?

### **Answer:**

In [ ]:
olympic_dataset.groupby('game_location').size()

game_location
Australia                      1
Australia, Sweden              1
Austria                        2
Belgium                        1
Brazil                         1
Canada                         3
China                          1
Federal Republic of Germany    1
Finland                        1
France                         5
Germany                        2
Great Britain                  3
Greece                         2
Italy                          3
Japan                          3
Mexico                         1
Netherlands                    1
Norway                         2
Republic of Korea              2
Russian Federation             1
Spain                          1
Sweden                         1
Switzerland                    2
USSR                           1
United States                  8
Yugoslavia                     1
dtype: int64

### **Question 02**:  CCreate a Series for the Olympics' location and the number of times it was held in that location. Use game_location to count the number of times.

ඔලිම්පික් ස්ථානය සහ එම ස්ථානයේ එය පැවැත්වූ වාර ගණන සඳහා මාලාවක් සාදන්න. වාර ගණන ගණන් කිරීමට game_location භාවිතා කරන්න.

### **Answer:**

In [ ]:
# pd.Series([2018, 2016], index=['pyeongchang-2018','rio-2016'], name="games")
olympic_dataset.groupby('game_location').size()

game_location
Australia                      1
Australia, Sweden              1
Austria                        2
Belgium                        1
Brazil                         1
Canada                         3
China                          1
Federal Republic of Germany    1
Finland                        1
France                         5
Germany                        2
Great Britain                  3
Greece                         2
Italy                          3
Japan                          3
Mexico                         1
Netherlands                    1
Norway                         2
Republic of Korea              2
Russian Federation             1
Spain                          1
Sweden                         1
Switzerland                    2
USSR                           1
United States                  8
Yugoslavia                     1
dtype: int64

In [ ]:
type(olympic_dataset.groupby('game_location').size())

pandas.core.series.Series

### **Question 03**: What are the maximum and minimum prices for each different type of `Vol.`?

එක් එක් විවිධ වර්ගයේ `Vol.` සඳහා උපරිම සහ අවම මිල ගණන් මොනවාද?

### **Answer:**

In [ ]:
cryptocurrencies_dataset.groupby('Vol.').Price.agg([min, max])

                  min        max
Vol.
0.0        -67.038486 -66.568486
410.0      -67.038486  12.701514
510.0       -3.158486  -3.158486
530.0       10.191514  10.191514
540.0       22.951514  22.951514
...               ...        ...
8480000.0  -67.028486 -67.028486
8620000.0  -67.028486 -67.028486
8880000.0  -67.048486 -67.048486
10250000.0 -67.028486 -67.028486
10500000.0 -67.028486 -67.028486

[1151 rows x 2 columns]

### **Question 04**: What is the most expensive type of currency based on the `Price`?

`Price` මත පදනම් වූ මිල අධිකම මුදල් වර්ගය කුමක්ද?

### **Answer:**

In [ ]:
price_values = cryptocurrencies_dataset.groupby('Vol.').Price.agg([min, max])
price_values.sort_values(by=['min', 'max'], ascending=False)

                  min         max
Vol.
52890.0    562.331514  562.331514
63380.0    528.121514  528.121514
52610.0    505.811514  505.811514
10920.0    461.291514  461.291514
27900.0    459.411514  459.411514
...               ...         ...
4940000.0  -67.048486  -67.048486
7600000.0  -67.048486  -67.048486
8030000.0  -67.048486  -67.048486
8170000.0  -67.048486  -67.048486
8880000.0  -67.048486  -67.048486

[1151 rows x 2 columns]

### **Question 05**: Create a Series whose index is `Low` and value is the average of  `Price`?

දර්ශකය `Low` වන සාමාන්‍ය අගය `Price` වන  මාලාවක් නිර්මාණය කරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset.groupby('Low').Price.mean()

Low
0.00      -67.046626
0.01      -67.037884
0.02      -67.027306
0.03      -67.017170
0.04      -67.004486
             ...
500.26    461.291514
506.71    528.121514
508.58    450.341514
509.59    448.401514
564.85    562.331514
Name: Price, Length: 351, dtype: float64

In [ ]:
cryptocurrencies_dataset

       SNo        Date       Price    Open  High     Low       Vol.  Change %
0        1  2018-01-30  -66.268486    0.17  0.45    0.14   530470.0     -7.95
1        4  2018-02-02  -66.268486    0.11  0.45    0.08  1810000.0     -8.32
2        3  2018-02-01  -66.268486    0.14  0.45    0.11   987260.0    -17.46
3        4  2018-02-02  -66.268486    0.11  0.45    0.08  1810000.0     -8.32
4        5  2018-02-03  -66.268486    0.10  0.45    0.09  1200000.0      6.85
...    ...         ...         ...     ...   ...     ...        ...       ...
1270  1271  2021-08-20  342.141514  405.27  0.45  403.54   155020.0      0.99
1271  1272  2021-08-21  332.791514  409.19  0.45  393.43   145060.0     -2.28
1272  1273  2021-08-22  333.911514  399.84  0.45  386.63    88070.0      0.28
1273  1274  2021-08-23  341.261514  400.96  0.45  399.45   139750.0      1.84
1274  1275  2021-08-24  333.971514  408.33  0.45  398.49   116250.0     -1.79

[1275 rows x 8 columns]

In [ ]:
cryptocurrencies_dataset.loc[:4, "Price"]

0   -66.268486
1   -66.268486
2   -66.268486
3   -66.268486
4   -66.268486
Name: Price, dtype: float64

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5].max() #Finding the max value

-66.26848627450984

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5] = cryptocurrencies_dataset.Price.iloc[:5].max()

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [ ]:
cryptocurrencies_dataset.Price.iloc[:5]

0   -66.268486
1   -66.268486
2   -66.268486
3   -66.268486
4   -66.268486
Name: Price, dtype: float64

### **Question 06**: What combination of `Low` and `Price` is the most common?   

වඩාත් සුලභ වන්නේ `Low` සහ `Price` යන සංයෝජනය කුමක්ද?

### **Answer:**

In [ ]:
cryptocurrencies_dataset.groupby(['Low', 'Price']).size().sort_values(ascending=False)

Low     Price
0.01    -67.038486     359
0.02    -67.028486     127
0.00    -67.048486      75
0.03    -67.018486      66
0.06    -66.988486      31
                      ...
307.91   249.691514      1
309.06   251.111514      1
309.63   253.501514      1
310.45   305.861514      1
184.86   120.241514      1
Length: 422, dtype: int64

# **Section 05**: Data Types and Missing Values දත්ත වර්ග සහ Missing අගයන්

In [ ]:
olympic_dataset.head()

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016
2        sochi-2014  2014-02-23T16:00:00Z  ...      Winter      2014
3       london-2012  2012-08-12T19:00:00Z  ...      Summer      2012
4    vancouver-2010  2010-02-28T04:00:00Z  ...      Winter      2010

[5 rows x 7 columns]

In [ ]:
cryptocurrencies_dataset.head()

   SNo        Date      Price  Open  High   Low       Vol.  Change %
0    1  2018-01-30 -66.268486  0.17  0.45  0.14   530470.0     -7.95
1    4  2018-02-02 -66.268486  0.11  0.45  0.08  1810000.0     -8.32
2    3  2018-02-01 -66.268486  0.14  0.45  0.11   987260.0    -17.46
3    4  2018-02-02 -66.268486  0.11  0.45  0.08  1810000.0     -8.32
4    5  2018-02-03 -66.268486  0.10  0.45  0.09  1200000.0      6.85

### **Question 01**: What is the data type of `game_name`?

`game_name` දත්ත වර්ගය කුමක්ද?

### **Answer:**

In [ ]:
olympic_dataset.game_name.dtype

dtype('O')

### **Question 02**:  Change the `Change %` values into integers. Hence, what will happen in result?

`Change %` අගයන් නිඛිල බවට වෙනස් කරන්න. ඒ නිසා, එහි ප්‍රතිඵලය කුමක් වේද?

### **Answer:**

In [ ]:
cryptocurrencies_dataset["Change %"].astype(int)

0       -7
1       -8
2      -17
3       -8
4        6
        ..
1270     0
1271    -2
1272     0
1273     1
1274    -1
Name: Change %, Length: 1275, dtype: int64

### **Question 03**: How can you confirm whether there are some missing values in `game_slug` or not?

`game_slug` හි යම් අගයන් නැති වී ඇත්දැයි ඔබ තහවුරු කරන්නේ කෙසේද?

### **Answer:**

In [ ]:
missing_ = olympic_dataset[olympic_dataset.game_slug.isnull()]
len(missing_)

0

# **Section 06**: Renaming and Combining නැවත නම් කිරීම සහ ඒකාබද්ධ කිරීම

In [ ]:
olympic_dataset.head()

          game_slug         game_end_date  ... game_season game_year
0  pyeongchang-2018  2018-02-25T08:00:00Z  ...      Winter      2018
1          rio-2016  2016-08-21T21:00:00Z  ...      Summer      2016
2        sochi-2014  2014-02-23T16:00:00Z  ...      Winter      2014
3       london-2012  2012-08-12T19:00:00Z  ...      Summer      2012
4    vancouver-2010  2010-02-28T04:00:00Z  ...      Winter      2010

[5 rows x 7 columns]

In [ ]:
cryptocurrencies_dataset.head()

   SNo        Date      Price  Open  High   Low       Vol.  Change %
0    1  2018-01-30 -66.268486  0.17  0.45  0.14   530470.0     -7.95
1    4  2018-02-02 -66.268486  0.11  0.45  0.08  1810000.0     -8.32
2    3  2018-02-01 -66.268486  0.14  0.45  0.11   987260.0    -17.46
3    4  2018-02-02 -66.268486  0.11  0.45  0.08  1810000.0     -8.32
4    5  2018-02-03 -66.268486  0.10  0.45  0.09  1200000.0      6.85

### **Question 01**: How can you rename `Low` and `High` with `Low` and `High`, respectively?

පිළිවෙලින් `Low` සහ `High` යන ඒවා `Low` සහ `High` ලෙස නැවත නම් කරන්නේ කෙසේද?

### **Answer:**

In [ ]:

renamed = cryptocurrencies_dataset.rename(columns=dict(Low='low', High='high'))

### **Question 02**:  Set the index name to crypto in cryptocurrencies_dataset.

`cryptocurrencies_dataset` හි දර්ශක නාමය crypto ලෙස සකසන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset.rename_axis('crypto', axis='rows')

         SNo        Date       Price    Open  High     Low       Vol.  Change %
crypto
0          1  2018-01-30  -66.268486    0.17  0.45    0.14   530470.0     -7.95
1          4  2018-02-02  -66.268486    0.11  0.45    0.08  1810000.0     -8.32
2          3  2018-02-01  -66.268486    0.14  0.45    0.11   987260.0    -17.46
3          4  2018-02-02  -66.268486    0.11  0.45    0.08  1810000.0     -8.32
4          5  2018-02-03  -66.268486    0.10  0.45    0.09  1200000.0      6.85
...      ...         ...         ...     ...   ...     ...        ...       ...
1270    1271  2021-08-20  342.141514  405.27  0.45  403.54   155020.0      0.99
1271    1272  2021-08-21  332.791514  409.19  0.45  393.43   145060.0     -2.28
1272    1273  2021-08-22  333.911514  399.84  0.45  386.63    88070.0      0.28
1273    1274  2021-08-23  341.261514  400.96  0.45  399.45   139750.0      1.84
1274    1275  2021-08-24  333.971514  408.33  0.45  398.49   116250.0     -1.79

[1275 rows x 8 columns]

In [ ]:
type(olympic_dataset.groupby('game_location').size())

pandas.core.series.Series

### **Question 03**: Combine the following datasets as one dataset.

පහත ඇති දත්ත කට්ටල එක් දත්ත කට්ටලයක් ලෙස ඒකාබද්ධ කරන්න.

### **Answer:**

In [ ]:
cryptocurrencies_dataset2 = pd.read_csv(cryptocurrencies_dataset_repo)
cryptocurrencies_dataset2.to_csv('/content/sample_data/cryptocurrencies.csv')

pd.concat([cryptocurrencies_dataset, cryptocurrencies_dataset2])

       SNo        Date       Price    Open    High     Low       Vol.  Change %
0        1  2018-01-30  -66.268486    0.17    0.45    0.14   530470.0     -7.95
1        4  2018-02-02  -66.268486    0.11    0.45    0.08  1810000.0     -8.32
2        3  2018-02-01  -66.268486    0.14    0.45    0.11   987260.0    -17.46
3        4  2018-02-02  -66.268486    0.11    0.45    0.08  1810000.0     -8.32
4        5  2018-02-03  -66.268486    0.10    0.45    0.09  1200000.0      6.85
...    ...         ...         ...     ...     ...     ...        ...       ...
1270  1271  2021-08-20  409.190000  405.27  420.72  403.54   155020.0      0.99
1271  1272  2021-08-21  399.840000  409.19  415.39  393.43   145060.0     -2.28
1272  1273  2021-08-22  400.960000  399.84  408.44  386.63    88070.0      0.28
1273  1274  2021-08-23  408.310000  400.96  415.14  399.45   139750.0      1.84
1274  1275  2021-08-24  401.020000  408.33  413.91  398.49   116250.0     -1.79

[2550 rows x 8 columns]